{
    "info": {
        "name": "Matt Levin",
        "email": "hello@mattlevin.io",
        "links": [
            {
                "name": "LinkedIn",
                "url": "https://www.linkedin.com/in/mklevin"
            },
            {
                "name": "GitHub",
                "url": "https://github.com/mklevin"
            },
            {
                "name": "Download"
            },
            {
                "name": "Fork this site!",
                "url": "https://github.com/mklevin/react-resume",
                "hideFromPrint": true
            }
        ]
    },
    "skills": [
        {
            "name": "Languages",
            "items": [
                "Java", 
                "Scala", 
                "Python", 
                "SQL", 
                "JavaScript/TypeScript", 
                "HTML/CSS", 
                "C#", 
                "C", 
                "C++", 
                "PHP"
            ]
        },
        {
            "name": "Frameworks & Libraries",
            "items": [
                "Scio (Apache Beam)", 
                "Luigi", 
                "Guava", 
                "GraphQL", 
                "PostgreSQL",
                "MySQL",
                "Android", 
                "React", 
                "Angular"]
        }, {
            "name": "Tools & Platforms",
            "items": [
                {
                    "name": "Google Cloud",
                    "items": [
                        "AppEngine",
                        "BigQuery", 
                        "BigTable", 
                        "Cloud Pub/Sub",
                        "Cloud SQL", 
                        "Cloud Storage", 
                        "Compute Engine", 
                        "Dataflow", 
                        "Kubernetes", 
                        "Spanner"
                    ]
                },
                "Git",
                "Subversion",
                "Unix/Linux",
                "Adobe Photoshop"
            ]
        }
    ],
    "education": [
        {
            "institute": "University of Delaware",
            "graduationDate": "May 2015",
            "degree": "Honors B.S., Computer Science",
            "subDegree": "Minor in Astronomy",
            "overallGpa": "3.6/4.0"
        }
    ],
    "experience": [
        {
            "company": "Spotify",
            "jobTitle": "Staff Engineer",
            "location": "New York, NY",
            "startDate": "March 2023",
            "endDate": "Present",
            "bullets": [
                {
                    "text": "Led technical discovery, developed architecture strategy, and supported three teams in the full-stack engineering build and launch of Listening Parties, brand-new artist-fan interactive experience with 95% fan satisfaction and 90% artist desirability.",
                    "links": [{
                        "text": "Listening Parties",
                        "link": "https://www.billboard.com/music/music-news/spotify-artist-wrapped-2023-listening-parties-merch-discounts-1235515287/"
                    }] 
                },
                "Partnered directly with managers and leadership to prioritize and plan technical work and facilitate cross-team collaboration.",
                "Evangelized technical discovery strategy across Spotify, including delivering company-wide talks, developing organization-wide discovery practices, and supporting teams, managers, and leads engaged in discovery throughout the company.",
                "Guaranteed both product quality and team health by mentoring engineers in the development of reliability and testing strategies, technical best practices. and systems for enforcing them."
            ]
        },
        {
            "company": "Spotify",
            "jobTitle": "Senior Software Engineer, Tech Lead",
            "location": "New York, NY",
            "startDate": "January 2019",
            "endDate": "March 2023",
            "bullets": [
                {
                    "text": "Drove greenfield technical discovery, proposed and built proof-of-concept experiments, and led a team of 6 engineers in the design, implementation, and scaling of new fan monetization features for artists.",
                    "links": [{
                        "text": "new fan monetization features for artists",
                        "link": "https://www.billboard.com/pro/spotify-live-audio-rooms-artist-fans-connections"
                    }]
                },
                "Led a team of 4 engineers in the design and implementation of a cross-channel (email & in-app) notification targeting and delivery platform for Spotify for Artists, which now serves millions of notifications daily.",
                {
                    "text": "Led a team of 3 engineers in the design and implementation of the backend systems and data pipelines that powered Spotify Wrapped for Artists 2020.",
                    "links": [{
                        "text": "Spotify Wrapped for Artists 2020",
                        "link": "https://artists.spotify.com/en/blog/your-2020-wrapped-is-here"
                    }]
                },
                {
                    "text": "Collaborated in the design and led the backend and personalization implementation of the Home screen for the Spotify for Artists mobile app.",
                    "links": [{
                        "text": "Home screen",
                        "link": "https://techcrunch.com/2019/09/24/spotifys-app-for-artists-gets-a-big-revamp-adds-real-time-stats-for-any-song"
                    }]
                },
                "Led a team of 4 engineers in the design and implementation of a customer support team admin tool for Spotify for Artists.",
                {
                    "text": "Designed and implemented a platform for automatically generating unique shareable social media assets for artists, which was used to power Spotify's largest election campaign to date.",
                    "links": [{
                        "text": "Spotify's largest election campaign to date.",
                        "link": "https://artists.spotify.com/en/blog/introducing-personalized-share-cards-to-encourage-your-fans-to-vote"
                    }]
                },
                "Managed relationships with team stakeholders, groomed and prioritized team backlogs, and worked directly with product and design partners to plan the team's future roadmap including advocating for prioritization of technical improvements."
            ]
        },
        {
            "company": "Google",
            "jobTitle": "Software Engineer",
            "location": "Sunnyvale, CA | New York, NY",
            "startDate": "August 2015",
            "endDate": "January 2019",
            "bullets": [
                "Designed and implemented a Java and Python-based data pipeline to make analytics from third-party contract analysis tools for over 100K contracts available to stakeholders across Google.",
                "Researched and implemented new performance and UX-focused features in Android and Angular frontends and a Google Cloud-based backend for a cross-platform issue-tracking app, resulting in a 250% increase in daily active users.",
                "Managed a team of two contractors to implement new features for and support users of third-party document management software.",
                "Led efforts to simultaneously improve test coverage and reduce test maintenance time by building an automated test data generation framework.",
                "Provided Java mentorship and over 1,000 code reviews to engineers across the company."
            ]
        },
        {
            "company": "JPMorgan Chase & Co.",
            "jobTitle": "Application Developer Intern",
            "location": "Newark, DE",
            "startDate": "June",
            "endDate": "August 2014",
            "bullets": [
                "Designed and implemented a Java-based multithreaded automation system for an international batch processing platform, reducing daily processing time by over 50%.",
                "Created a user interface for triggering and monitoring automation using a vendor toolkit and C#.",
                "Communicated and persisted data between front and back ends using Sybase ASE databases.",
                "Used Agile Scrum methodology to conduct eight one-week sprints to meet the needs of product owners while giving weekly sprint demonstrations."
            ]
        },
        {
            "hidden": true,
            "company": "Agilent Technologies",
            "jobTitle": "Software Engineering Intern",
            "location": "Wilmington, DE",
            "startDate": "May",
            "endDate": "August 2013",
            "bullets": [
                "Implemented a PHP-driven system for delivering, validating, and installing firmware updates to Linux-based machines.",
                "Built a Sencha Touch Javascript tablet application for managing and selecting update packages."
            ]
        }
    ]
}
